# 비동기

비동기를 알기 전에 동기를 알아보자

### 동기

동기는 작업들을 **순차적으로** 처리하는 방법이다
(작업을 아무리 오래 기다려야 한다면 기다리고 처리하는 방식)

→ 즉 비동기는 아닐 비(非)자를 쓴 단어이며
의미도 작업들을 처리가 될때까지 기다리지 않고 다른 작업들을 처리하는 방법이다

## 특징

작업을 기다리지 않고 다른 작업을 수행한다는 특징이 있으며
한개의 스레드로 여러개의 스레드를 사용한 것과 같은 효과를 낸다

추가로 기다려야 하는 작업들은 네트워크 요청, DB연동, 파일I/O등 이 있는데
이것들은 전부 외부 자원들이다

### 장점

- 작업을 기다리는 시간에 다른 작업들을 수행 → 작업속도가 빨라짐
- 유휴시간 최소화
이것도 스레드가 쉬는 시간을 줄이는 방법

### 단점

- 동시성 문제 발생(다만 자주 비동기로 인해 발생하는건 아닙니다)
~~(더알고 싶다면 밑에 있는 노션 클릭)~~
[동시성의 문제 - Race Condition & **Critical Section** (임계구역)](https://www.notion.so/Race-Condition-Critical-Section-2df86eaf14b8809fa456e4e19bf8f7ee?pvs=21)
    - Q : 그게 뭔가요? 그리고 왜 발생하나요?
    A : 동시성 문제는 동시에 공유자원에 접근할 때 발생하는 문제입니다
    그리고 A작업을 기다려야 하는 시간에 다른 작업을 수행하는데
    이때 다른 작업이 A작업이 쓰고 있는 공유자원에 접근할 때 발생합니다
- 동기에 비해 구현이 어려움

### VS 멀티 스레드

멀티스레드는 여러개의 스레드가 한 프로세스의 작업들을 동시에 수행하는것이다
즉 차이점은 기다려야 하는 작업을 기다리지 않고 다른 작업으로 넘어가 처리한다와 동시에 여러개의 스래드가 작업들을 처리한다가 된다(완벽히 다름!)
+ 추가로 멀티 스레드도 동시성의 문제가 발생한다(비동기 싱글 스레드보다 많이 발생함)

---

# 동시성

cpu가 여러개의 프로세스(스레드)를 동시에 처리하는 것처럼 보이게 하는 것이며
자세히는 문맥교환또는 시분할을 통해 프로세스들을 처리하는 방법이다

## 특징

작업들을 동시에 처리하는 것이 아닌 처리하는 것처럼 보이게 하는 방식이며
cpu코어가 여러개 있어도 프로세스가 더 많으면 사용할 수 있는 방식이다
또한 특정 코어에 과부하가 걸리지 않게 균등하게 할때도 사용한다

### 장점

- 여러개의 작업들을 처리한다는 장점이 있다
- 유휴시간 최소화를 시킬수 있다

### 단점

- 동시성 문제가 발생한다
    - Q : 왜 발생하나요?
    A : 여러개의 작업 흐름 때문에 발생합니다
    자세히 말하면 여러개의 작업 흐름이 공유자원에 접근할때 발생하는 문제입니다
- 또한 구현하느라 코드의 복잡성이 증가하며 시분할, 문맥교환으로 인한 오버헤드가 발생한다
    - 오버헤드 : 작업과 다른 일을 할때 생기는 부가적인 자원 손실

---

# 병렬성

동시성과 다르게 진짜로 여러개의 프로세스를 처리하는 방법이다

## 특징

여러개의 cpu로 작업들을 동시에 그리고 독립적으로 처리하는 방식이고
또한 문맥교환, 시분할을 사용하지 않아도 동시에 작업들이 처리된다

### 장점

- 여러개의 작업들을 처리할 수 있다
- 문맥 교환, 시분할로 인한 오버헤드는 감소한다
Q : 병렬성은 문맥교환이나 시분할로 구현하는게 아닌 현실의 cpu코어로 구현되는 방법인데 왜 사라지지 않는건가요?
A : 병렬성의 단점 중의 1개인 현실적인 문제로 구현하기 힘든것과 관련이 있습니다
cpu코어를 2000개 씩이나 넣기에는 비용적인 문제와 공간적인 문제 등이 가로막기에 cpu코어를 여러개 넣지만 스레드 갯수보다는 작습니다 또한 cpu의 개수 < 프로세스라면 동시성이 필요합니다
즉 사라지지 않는 이유는 현실적인 문제로 인한 스레드의 문맥 교환과 동시성 때문입니다

### 단점

- 이것또한 동시에 실행하기에 동시성의 문제가 발생한다
    - Q : 아니 동시성의 문제는 한개의 cpu로 여러개의 프로세스를 해결할려고 해서 생기는 문제가 아닌가요?
    A : 예 아닙니다
    여러개의 cpu가 동시에 프로세스를 해결한다해도 공유자원은 메모리에 있습니다
    즉 cpu의 갯수와 상관없이 공유자원에 동시에 접근한다면 발생하는 문제입니다
- 현실적인 문제로 구현하기 힘들다

---

# 비동기 VS 동시성 VS 병렬성

비동기는 네트워크 연결과 같은 기다려야 하는 작업들을 기다리지 않는다는 점이 특징이며

동시성은 프로세스 개수보다 적은 cpu 개수로 여러개의 작업(스레드)을 동시에 하는 것처럼 보이게 한다는 점
Q : 동시성은 cpu 개수와 프로세스 개수와 관련이 있는데 여러개의 스레드를 동시에 한다는건 무엇인가요?
A : 프로세스의 작업단위는 스레드입니다 즉 cpu가 프로세스(작업)을 실행한다는 것은 그 프로세스에 속한  스레드를 실행시키는 것과 같습니다

그리고 병렬성은 많은 cpu코어로 여러개의 작업을 진짜로 동시에 처리한다는 점

# 깨달은 점

사실 필자는 여태껏 단일 작업 < 다중 작업 이란 생각이 컸지만 이렇게 정리를 하니
내가 가지고 있던 생각들은 너무 안좋은 생각이란걸 깨닫게 되었다
그리고 위 3가지 모두 동시성의 문제를 일으킨다는 점이 알고 있었지만 그럼에도 놀라운 점이였다
또한 위 3가지 방식들은 각기 다른 특징을 가지고 있지만 모두 같은 목표인 처리 속도 증가에 있다는 것에
더욱 기억에 남을 개념들이 된거 같다

## 출처

- https://plas.tistory.com/149
- https://velog.io/@go90js/%EB%8F%99%EC%8B%9C%EC%84%B1-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D%EA%B3%BC-%EB%B9%84%EB%8F%99%EA%B8%B0-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D
- https://wikidocs.net/133213
- https://yeti.tistory.com/379#google_vignette
- https://velog.io/@kwontae1313/%EB%8F%99%EC%8B%9C%EC%84%B1%EA%B3%BC-%EB%B3%91%EB%A0%AC%EC%84%B1%EC%9D%98-%EA%B0%9C%EB%85%90%EA%B3%BC-%EC%B0%A8%EC%9D%B4
- https://0soo.tistory.com/119
- https://kr.linkedin.com/pulse/scenarios-advantagesdisadvantages-parallel-aseman-arabsorkhi-qm8lc?tl=ko
- https://glow28.tistory.com/26
